[
  {
    "id": "case01",
    "name": "Homicídio no Motel Aurora",
    "description": "Um corpo foi encontrado em um quarto do Motel Aurora, na saída leste de Valley City. Há sinais de luta, mas quase nenhuma testemunha disposta a falar.",
    "introImage": "crime_scene_01",

    "witnesses": [
      {
        "id": "w1",
        "name": "Carla Mendes",
        "role": "Recepcionista do motel",
        "image": "witness_01",
        "initial": "Eu estava no balcão quando ouvi uma discussão no quarto 207. Uns 10 minutos depois, o hóspede do quarto ao lado ligou dizendo que tinha escutado algo pesado caindo.",
        "answers": {
          "where": "Eu estava na recepção, conferindo as reservas da madrugada.",
          "knowVictim": "Eu só sabia o primeiro nome pelo cadastro: Lucas. Ele pagou em dinheiro e estava visivelmente nervoso.",
          "seeSomeone": "Eu vi uma mulher entrando com ele, cabelo castanho, jaqueta de couro escura. Ela não quis se identificar.",
          "hear": "Ouvi vozes altas, parecia uma briga de casal. Depois um barulho forte, como se algo caísse ou fosse empurrado.",
          "moreInfo": "Pouco antes de subir, vi um carro preto parado na rua lateral. Achei estranho porque não era cliente do motel."
        }
      },
      {
        "id": "w2",
        "name": "Jeff Turner",
        "role": "Hóspede do quarto ao lado",
        "image": "witness_02",
        "initial": "Eu estava tentando dormir. De repente, ouvi gritos, xingamentos e depois um baque forte. Fiquei com medo de sair.",
        "answers": {
          "where": "Eu estava no quarto 208, deitado na cama, com a TV desligada.",
          "knowVictim": "Não conhecia. Só ouvi alguém batendo a porta do quarto 207 mais cedo naquela noite.",
          "seeSomeone": "Pelo olho mágico, vi apenas uma sombra saindo rápido, parecia ser uma única pessoa, usando capuz.",
          "hear": "Ouvi algo como 'você arruinou tudo' e depois um grito curto.",
          "moreInfo": "Acho que depois do baque alguém trancou a porta com pressa. Os passos no corredor foram bem rápidos."
        }
      },
      {
        "id": "w3",
        "name": "Oficial Ramirez",
        "role": "Primeiro policial na cena",
        "image": "witness_03",
        "initial": "Quando cheguei, a porta estava trancada por dentro. Tivemos que arrombá-la. Não havia sinais de fuga pela janela.",
        "answers": {
          "where": "Eu estava em patrulha nas proximidades quando a central chamou para atender à ocorrência.",
          "knowVictim": "Ainda não, só depois no sistema soubemos que ele tinha passagem por fraude financeira.",
          "seeSomeone": "Quando cheguei, o corredor estava vazio, só a recepcionista e o gerente na recepção.",
          "hear": "Não ouvi nada além do barulho da porta sendo arrombada pela equipe.",
          "moreInfo": "O corpo estava próximo à cama, e havia uma mala aberta com papéis espalhados. Não mexemos em nada até a perícia chegar."
        }
      },
      {
        "id": "w4",
        "name": "Gerente do Motel",
        "role": "Gerente",
        "image": "witness_05",
        "initial": "Eu estava no escritório cuidando das planilhas. Só desci quando a recepcionista me chamou dizendo que havia algo errado.",
        "answers": {
          "where": "No escritório, nos fundos do prédio, revisando o caixa.",
          "knowVictim": "Não pessoalmente. Era mais um cliente anônimo, pagou em dinheiro e pediu discrição.",
          "seeSomeone": "Vi na câmera do corredor uma pessoa de jaqueta escura saindo, mas o rosto não aparece.",
          "hear": "Nada, meu escritório é isolado acusticamente.",
          "moreInfo": "As câmeras da garagem estavam desligadas. Alguém mexeu no DVR algumas horas antes."
        }
      },
      {
        "id": "w5",
        "name": "Vizinho da rua lateral",
        "role": "Morador local",
        "image": "witness_06",
        "initial": "Eu só percebi um carro preto acelerando forte por volta das 23h30. O motel costuma ser barulhento, mas essa noite parecia pior.",
        "answers": {
          "where": "Eu estava na varanda, fumando, olhando a rua.",
          "knowVictim": "Não, nunca o vi antes.",
          "seeSomeone": "Só vi o carro, um sedã preto, com película escura. Placa começando com VCL.",
          "hear": "Um barulho de pneu cantando, e alguém gritando ao longe, mas não deu pra entender.",
          "moreInfo": "Esse carro preto já apareceu antes por aqui, geralmente não estaciona na entrada principal."
        }
      }
    ],

    "suspects": [
      {
        "id": "s1",
        "name": "Marina Costa",
        "occupation": "Ex-namorada da vítima",
        "age": 29,
        "address": "Bairro Riverside, apartamento 302",
        "record": "Sem antecedentes criminais. Boletim de ocorrência por ameaça há 2 meses, envolvendo a vítima.",
        "image": "suspect_01",
        "isGuilty": true,
        "stats": { "stress": 45, "confidence": 60, "anger": 30 },
        "answers": {
          "alibi": "Eu estava na casa da minha avó jogando videogame com meu irmão. Ele pode confirmar.",
          "relation": "Tivemos um relacionamento complicado. Ele me traiu e me envolveu em dívidas que não eram minhas.",
          "motive": "Talvez as pessoas achem que eu seria capaz de algo assim por causa das brigas, mas eu só queria distância.",
          "witness": "Meu irmão estava comigo a noite toda. Pergunta pra ele.",
          "stress": "Ninguém gosta de ser acusado de assassinato. Estou nervosa, sim.",
          "weapon": "Eu não tenho arma. E nunca toquei em nada relacionado a isso."
        },
        "warrantEvidence": [
          {
            "id": "w1_e1",
            "title": "Jaqueta de couro manchada",
            "type": "Objeto",
            "description": "Jaqueta de couro escura com pequenas manchas de sangue compatíveis com o tipo sanguíneo da vítima.",
            "image": "evidence_obj_01",
            "relevance": "Aumenta a ligação física de Marina com a cena do crime."
          },
          {
            "id": "w1_e2",
            "title": "Mensagens impressas",
            "type": "Documento",
            "description": "Impressões de mensagens onde Marina ameaça 'acertar as contas' com Lucas pela fraude.",
            "image": "evidence_doc_01",
            "relevance": "Indica forte motivação emocional e financeira."
          }
        ]
      },
      {
        "id": "s2",
        "name": "Bruno Sanches",
        "occupation": "Parceiro de negócios da vítima",
        "age": 34,
        "address": "Centro financeiro de Valley City, loft 905",
        "record": "Suspeito em investigação de lavagem de dinheiro, sem condenações.",
        "image": "suspect_02",
        "isGuilty": false,
        "stats": { "stress": 30, "confidence": 70, "anger": 20 },
        "answers": {
          "alibi": "Eu estava em uma reunião com investidores, online, das 22h às 23h30. Há registros de login.",
          "relation": "Sócios, mais nada. Ele tomava riscos que eu não tomaria.",
          "motive": "Se alguém acha que eu o mataria por negócios, não entende como o mundo real funciona.",
          "witness": "Qualquer pessoa na chamada de vídeo pode confirmar minha presença.",
          "stress": "Este tipo de acusação pode arruinar uma carreira inteira, é claro que estou tenso.",
          "weapon": "Nunca precisei de armas. Meu trabalho é com contratos, não com violência."
        },
        "warrantEvidence": [
          {
            "id": "w1_e3",
            "title": "Agenda com anotação de reunião",
            "type": "Documento",
            "description": "Agenda física marcando reunião online no mesmo horário do crime.",
            "image": "evidence_text_01",
            "relevance": "Corrobora parcialmente o álibi, mas precisa ser cruzado com registros digitais."
          }
        ]
      },
      {
        "id": "s3",
        "name": "Eduardo Lima",
        "occupation": "Motorista de aplicativo",
        "age": 41,
        "address": "Subúrbio norte, casa 12",
        "record": "Uma passagem antiga por direção perigosa.",
        "image": "suspect_03",
        "isGuilty": false,
        "stats": { "stress": 25, "confidence": 50, "anger": 15 },
        "answers": {
          "alibi": "Eu deixei um passageiro no motel por volta das 21h50 e depois continuei as corridas.",
          "relation": "Só um cliente. Nunca tinha visto esse homem antes.",
          "motive": "Não tenho motivo algum. Eu só dirijo.",
          "witness": "Os registros do aplicativo mostram meu trajeto e horário.",
          "stress": "Ser envolvido num caso de homicídio só porque você faz corridas na região é absurdo.",
          "weapon": "Não tenho arma, e o carro foi vistoriado."
        },
        "warrantEvidence": []
      }
    ],

    "evidence": [
      {
        "id": "e1",
        "title": "Fotos da cena do crime",
        "type": "Fotografia",
        "description": "Fotos do corpo próximo à cama, mala aberta e papéis espalhados pelo quarto.",
        "image": "crime_scene_01",
        "relevance": "Mostra sinais de luta concentrados próximos à cama, sem tentativa de fuga pela janela."
      },
      {
        "id": "e2",
        "title": "Relatório parcial da perícia",
        "type": "Documento",
        "description": "Causa da morte: forte impacto na parte posterior da cabeça, possivelmente contra a quina da mesa.",
        "image": "evidence_doc_02",
        "relevance": "Sugere briga física levando a empurrão, e não apenas ataque com arma."
      },
      {
        "id": "e3",
        "title": "Registros de mensagens da vítima",
        "type": "Digital",
        "description": "Mensagens recentes mostrando discussão intensa com Marina sobre dívidas e traições.",
        "image": "evidence_text_01",
        "relevance": "Estabelece motivo emocional e financeiro para Marina."
      }
    ]
  },

  {
    "id": "case02",
    "name": "Assalto à Joalheria Central",
    "description": "Uma joalheria de luxo no centro de Valley City foi assaltada minutos antes de fechar. O sistema de alarme falhou e a polícia chegou tarde demais.",
    "introImage": "crime_scene_02",

    "witnesses": [
      {
        "id": "w1",
        "name": "Helena Foster",
        "role": "Caixa da joalheria",
        "image": "witness_11",
        "initial": "Eu estava fechando o caixa quando dois indivíduos entraram usando máscaras simples e jaquetas largas. Um deles parecia conhecer bem o sistema.",
        "answers": {
          "where": "Atrás do balcão, conferindo notas fiscais e o caixa.",
          "knowVictim": "A vítima principal foi o segurança, o senhor Collins. Eu trabalhava com ele há anos.",
          "seeSomeone": "Um dos assaltantes tinha tatuagem visível no pescoço, uma espécie de coroa.",
          "hear": "Eles sabiam onde estavam as câmeras e pediram para eu não acionar o alerta silencioso.",
          "moreInfo": "Um ex-funcionário, Daniel, foi demitido recentemente e sabia como o alarme funcionava."
        }
      },
      {
        "id": "w2",
        "name": "Thomas Collins",
        "role": "Segurança (sobreviveu com ferimentos)",
        "image": "witness_12",
        "initial": "Tentaram me render pelas costas, mas eu reagi. Levei uma coronhada e desmaiei. Lembro só de ouvir um deles chamando o outro de 'Dani'.",
        "answers": {
          "where": "Próximo à porta de entrada, fazendo a ronda final.",
          "knowVictim": "Eu sou o segurança, não vítima mortal, mas quase virei uma.",
          "seeSomeone": "Só tive certeza de que um deles mancava levemente da perna esquerda.",
          "hear": "Ouvi 'Dani, rápido, pega o estojo azul'. Isso ficou martelando na minha cabeça.",
          "moreInfo": "Um dos assaltantes parecia hesitar, como se não estivesse acostumado com violência."
        }
      }
    ],

    "suspects": [
      {
        "id": "s1",
        "name": "Daniel Ortiz",
        "occupation": "Ex-técnico de segurança da joalheria",
        "age": 32,
        "address": "Bairro Industrial, galpão adaptado",
        "record": "Demissão recente por violar protocolos internos, sem antecedentes criminais graves.",
        "image": "suspect_04",
        "isGuilty": true,
        "stats": { "stress": 60, "confidence": 40, "anger": 35 },
        "answers": {
          "alibi": "Eu estava em casa arrumando currículo. Desde que fui demitido, não saio muito.",
          "relation": "Trabalhei anos lá. Fui demitido por um erro que não foi só meu.",
          "motive": "Perdi o emprego e não recebi nada justo. Mas isso não quer dizer que eu roubaria o lugar.",
          "witness": "Meu vizinho às vezes me vê em casa, mas naquela hora não tenho certeza.",
          "stress": "Perder o emprego mexe com qualquer um. Não significa que eu seja um ladrão.",
          "weapon": "Nunca tive arma. E se alguém usou meu conhecimento, não fui eu."
        },
        "warrantEvidence": [
          {
            "id": "c2_e1",
            "title": "Estojo azul vazio",
            "type": "Objeto",
            "description": "Estojo idêntico ao usado na joalheria para guardar as peças mais caras, encontrado no galpão de Daniel.",
            "image": "evidence_obj_02",
            "relevance": "Conecta diretamente o local de Daniel aos itens roubados."
          },
          {
            "id": "c2_e2",
            "title": "Máscara de tecido",
            "type": "Objeto",
            "description": "Máscara simples com resquícios de partículas de vidro compatíveis com a vitrine quebrada.",
            "image": "evidence_obj_03",
            "relevance": "Sugere participação ou contato direto com o cenário do crime."
          }
        ]
      },
      {
        "id": "s2",
        "name": "Leonard Price",
        "occupation": "Cliente frequente",
        "age": 45,
        "address": "Condomínio de luxo, Torre A, ap. 1501",
        "record": "Envolvido em processos civis por dívidas, sem condenações criminais.",
        "image": "suspect_05",
        "isGuilty": false,
        "stats": { "stress": 35, "confidence": 65, "anger": 20 },
        "answers": {
          "alibi": "Eu estava em um jantar de negócios, posso fornecer nomes.",
          "relation": "Compro presentes lá com frequência, principalmente joias personalizadas.",
          "motive": "Dívidas não me fariam assaltar uma loja que frequento há anos.",
          "witness": "Os convidados do jantar podem confirmar minha presença.",
          "stress": "Ser associado a isso é injusto. Estou cooperando.",
          "weapon": "Jamais. Não tenho arma e não preciso disso."
        },
        "warrantEvidence": []
      }
    ],

    "evidence": [
      {
        "id": "e1",
        "title": "Imagens da câmera interna",
        "type": "Digital",
        "description": "Mostram dois assaltantes com máscaras simples, um deles usando jaqueta idêntica à de Daniel em fotos antigas.",
        "image": "evidence_room",
        "relevance": "Sugere que alguém com acesso prévio ao sistema sabia pontos cegos das câmeras."
      },
      {
        "id": "e2",
        "title": "Relatório do alarme",
        "type": "Documento",
        "description": "Falha no alarme coincidindo com horário em que credenciais antigas ainda estavam ativas.",
        "image": "evidence_doc_01",
        "relevance": "Indica uso indevido de credenciais internas, possivelmente de ex-funcionário."
      }
    ]
  },

  {
    "id": "case03",
    "name": "Incêndio Suspeito em Armazém",
    "description": "Um armazém no bairro portuário pegou fogo durante a madrugada. Há indícios de incêndio criminoso para ocultar outras atividades.",
    "introImage": "crime_scene_03",

    "witnesses": [
      {
        "id": "w1",
        "name": "Miguel Herrera",
        "role": "Vigia noturno do galpão ao lado",
        "image": "witness_13",
        "initial": "Eu vi um furgão branco estacionar perto do armazém umas 2 horas antes do incêndio. Depois disso, só percebi as chamas.",
        "answers": {
          "where": "Eu estava no meu posto de vigilância, com visão parcial da rua lateral.",
          "knowVictim": "Conheço o dono só de vista, sempre apressado e falando ao telefone.",
          "seeSomeone": "Vi duas figuras descendo do furgão, uma delas carregando algo como um galão.",
          "hear": "Ouvi barulho de metal batendo e algo como um estouro menor antes do incêndio maior.",
          "moreInfo": "Esse armazém quase nunca recebe mercadoria à noite. Foi estranho ver movimento."
        }
      },
      {
        "id": "w2",
        "name": "Tenente Harper",
        "role": "Bombeiro responsável pelo combate",
        "image": "witness_14",
        "initial": "O fogo começou muito rápido, típico de combustível acelerante. As saídas de emergência estavam parcialmente bloqueadas.",
        "answers": {
          "where": "Liderando a equipe de combate ao fogo na fachada principal.",
          "knowVictim": "Não, só fomos informados que era um armazém de estocagem diversa.",
          "seeSomeone": "Quando chegamos, só curiosos na rua, ninguém fugindo.",
          "hear": "Apenas estouros de material queimando.",
          "moreInfo": "O padrão de queima indica que o fogo começou em pelo menos dois pontos diferentes."
        }
      }
    ],

    "suspects": [
      {
        "id": "s1",
        "name": "Henry Doyle",
        "occupation": "Proprietário do armazém",
        "age": 52,
        "address": "Bairro residencial West Hills",
        "record": "Histórico de dívidas, seguro alto contratado recentemente.",
        "image": "suspect_06",
        "isGuilty": true,
        "stats": { "stress": 55, "confidence": 50, "anger": 25 },
        "answers": {
          "alibi": "Eu estava em casa dormindo. Minha esposa pode confirmar.",
          "relation": "O armazém era meu investimento principal. Perdi tudo.",
          "motive": "Se eu estivesse desesperado, teria vendido o imóvel, não ateado fogo.",
          "witness": "Minha esposa e minha conta de streaming mostram que eu estava vendo TV até tarde.",
          "stress": "Você não tem ideia do que é ver seu negócio pegando fogo.",
          "weapon": "Não tenho nada a ver com combustível. Esse tipo de coisa fica com transportadoras."
        },
        "warrantEvidence": [
          {
            "id": "c3_e1",
            "title": "Apólice de seguro recente",
            "type": "Documento",
            "description": "Seguro ampliado para cobertura de incêndio assinado apenas duas semanas antes.",
            "image": "evidence_doc_02",
            "relevance": "Indica possível motivação financeira clara para o incêndio."
          },
          {
            "id": "c3_e2",
            "title": "Recibo de compra de combustível",
            "type": "Documento",
            "description": "Recibo de grande quantidade de combustível adquirido em nome de um intermediário ligado a Henry.",
            "image": "evidence_text_01",
            "relevance": "Conecta indiretamente Henry ao material usado para iniciar o fogo."
          }
        ]
      },
      {
        "id": "s2",
        "name": "Jason Reed",
        "occupation": "Motorista de furgão",
        "age": 38,
        "address": "Zona portuária, quarto alugado",
        "record": "Pequenos furtos na juventude, nada grave nos últimos anos.",
        "image": "suspect_07",
        "isGuilty": false,
        "stats": { "stress": 40, "confidence": 55, "anger": 20 },
        "answers": {
          "alibi": "Trabalhei fazendo entregas, mas meu turno acabou antes da meia-noite.",
          "relation": "Só transporto mercadorias. Se descarreguei ali, foi trabalho.",
          "motive": "Nenhum. Eu só quero receber em dia.",
          "witness": "Meu supervisor e registros de GPS do furgão.",
          "stress": "Ser ligado a isso pode me tirar o emprego. Claro que estou tenso.",
          "weapon": "O furgão já carregou combustível, mas sempre dentro das normas."
        },
        "warrantEvidence": []
      }
    ],

    "evidence": [
      {
        "id": "e1",
        "title": "Fotos da estrutura queimada",
        "type": "Fotografia",
        "description": "Pontos de início do fogo em duas áreas distintas do armazém.",
        "image": "exam_room",
        "relevance": "Sugere que o incêndio foi iniciado em mais de um local, indicando intenção."
      },
      {
        "id": "e2",
        "title": "Laudo preliminar dos bombeiros",
        "type": "Documento",
        "description": "Indícios de uso de acelerantes químicos em determinadas zonas do piso.",
        "image": "evidence_doc_01",
        "relevance": "Refuta a hipótese de curto-circuito acidental simples."
      }
    ]
  }
]
