[
  {
    "id": 1,
    "title": "O Quadro Desaparecido",
    "difficulty": "Fácil",
    "location": "Museu Municipal de Arte",
    "intro": "Um quadro valioso sumiu poucas horas antes da abertura de uma grande exposição.",
    "story": "Você é chamado ao Museu Municipal de Arte quando o diretor descobre que 'A Noite Sobre o Vale', a pintura mais importante da mostra, desapareceu da sala de segurança.",
    "clues": [
      "O sistema registrou que a porta do cofre foi aberta apenas uma vez na última hora.",
      "Uma luva de tecido fino foi encontrada caída perto da porta do cofre.",
      "A câmera da sala do cofre ficou borrada por 10 segundos, exatamente no horário do sumiço."
    ],
    "suspects": [
      {
        "id": "a",
        "name": "Júlio, o Curador",
        "description": "Trabalha há anos no museu. Foi visto discutindo com o diretor sobre cortes de orçamento.",
        "isGuilty": false
      },
      {
        "id": "b",
        "name": "Carla, a Restauradora",
        "description": "Teria acesso à chave reserva do cofre. Está sempre usando luvas de tecido para proteger as obras.",
        "isGuilty": true
      },
      {
        "id": "c",
        "name": "Rogério, o Segurança",
        "description": "Responsável pelo monitoramento das câmeras. Diz que o sistema travou por alguns segundos.",
        "isGuilty": false
      }
    ]
  },
  {
    "id": 2,
    "title": "O Segredo do Café 24h",
    "difficulty": "Médio",
    "location": "Café Esquina do Vale",
    "intro": "O dono de um café 24 horas afirma que alguém está roubando dinheiro do caixa durante a madrugada.",
    "story": "Não há sinais de arrombamento e o dono garante que só três pessoas têm a chave: ele, o atendente da madrugada e a gerente.",
    "clues": [
      "Os relatórios de vendas mostram um pico de consumo em um horário em que quase não há clientes.",
      "A gerente vive reclamando do salário baixo, mas apareceu com um celular novo.",
      "O atendente costuma levar amigos para o café depois do turno para 'fechar o dia'."
    ],
    "suspects": [
      {
        "id": "a",
        "name": "Paulo, o Dono",
        "description": "Controlador, sabe tudo o que acontece no café. Diz que sempre confere o caixa pessoalmente.",
        "isGuilty": false
      },
      {
        "id": "b",
        "name": "Lígia, a Gerente",
        "description": "Responsável pelos relatórios de vendas. Tem a senha do sistema e a chave do estabelecimento.",
        "isGuilty": true
      },
      {
        "id": "c",
        "name": "Mateus, o Atendente da Madrugada",
        "description": "Carismático, vive cheio de amigos. Diz que não entende nada de sistema e só ‘marca no caderninho’.",
        "isGuilty": false
      }
    ]
  },
  {
    "id": 3,
    "title": "O Laptop Silencioso",
    "difficulty": "Fácil",
    "location": "Estação Central do Vale",
    "intro": "Um laptop com dados sigilosos desapareceu da sala de funcionários da estação.",
    "story": "A sala fica trancada, mas muitas pessoas entram e saem ao longo do dia. O dono jura que deixou o laptop carregando sobre a mesa.",
    "clues": [
      "Um carregador continua conectado à tomada, mas o laptop não está mais ali.",
      "Um bilhete amassado no lixo diz: 'Traga o pendrive hoje, antes do plantão'.",
      "Câmeras mostram um funcionário saindo apressado, segurando uma mochila maior do que o normal."
    ],
    "suspects": [
      {
        "id": "a",
        "name": "Bianca, Analista de Dados",
        "description": "Tem acesso aos arquivos sigilosos e costuma levar trabalho para casa.",
        "isGuilty": false
      },
      {
        "id": "b",
        "name": "Henrique, Técnico de TI",
        "description": "Vive reclamando que ninguém faz backup. Sabe todas as senhas da rede.",
        "isGuilty": false
      },
      {
        "id": "c",
        "name": "Douglas, Plantonista da Noite",
        "description": "Foi visto saindo carregando uma mochila cheia no final do turno.",
        "isGuilty": true
      }
    ]
  }
]
