[
  {
    "id": 1,
    "title": "O Quadro Desaparecido",
    "difficulty": "Fácil",
    "location": "Museu Municipal de Arte",
    "intro": "Um quadro famoso sumiu poucas horas antes da abertura de uma grande exposição.",
    "story": "Você é chamado ao museu quando o diretor descobre que 'A Noite Sobre o Vale' desapareceu do cofre. Apenas três pessoas tiveram acesso ao local nas últimas horas.",
    "clues": [
      "A câmera de segurança ficou desligada por 10 minutos.",
      "O segurança noturno ouviu passos às 02h17.",
      "Um funcionário tem dívidas altas de jogo."
    ],
    "suspects": [
      {
        "id": "seguranca",
        "name": "Marcelo, o segurança",
        "description": "Trabalha há 10 anos no museu, parece nervoso e evita contato visual."
      },
      {
        "id": "curadora",
        "name": "Dra. Helena, a curadora",
        "description": "Conhece cada obra de arte, foi a última a sair antes do sumiço."
      },
      {
        "id": "estagiario",
        "name": "Jonas, o estagiário",
        "description": "Jovem entusiasmado, mas com pouco acesso às áreas restritas."
      }
    ],
    "correctSuspectId": "curadora",
    "solutionText": "A curadora tinha a senha do cofre e aproveitou a falha da câmera para agir."
  },

  {
    "id": 2,
    "title": "O Misterioso Apagão no Vale",
    "difficulty": "Médio",
    "location": "Bairro Central do Vale",
    "intro": "Um apagão inesperado deixou todo o bairro às escuras por 15 minutos.",
    "story": "Pouco antes do apagão, um carro-forte passava pela avenida. O Capitão suspeita de sabotagem.",
    "clues": [
      "Moradores ouviram um estrondo na subestação elétrica.",
      "A empresa de energia não registrou falhas técnicas.",
      "Um vídeo mostra um grupo perto da subestação minutos antes."
    ],
    "suspects": [
      {
        "id": "tecnico",
        "name": "Rafael, o técnico",
        "description": "Tem acesso à subestação e conhecimento para provocar o apagão."
      },
      {
        "id": "moradora",
        "name": "Dona Zuleica",
        "description": "Moradora antiga, mas sem acesso a sistemas elétricos."
      },
      {
        "id": "chefe_bando",
        "name": "Cassiano, chefe de quadrilha",
        "description": "Já investigado anteriormente, mas nunca foi pego."
      }
    ],
    "correctSuspectId": "tecnico",
    "solutionText": "O técnico manipulou o sistema internamente, sincronizando o apagão com a passagem do carro-forte."
  },

  {
    "id": 3,
    "title": "Notas Falsas na Feira",
    "difficulty": "Fácil",
    "location": "Feira Municipal do Vale",
    "intro": "Feirantes reclamaram de grande circulação de notas falsas.",
    "story": "O capitão acredita que alguém na feira esteja distribuindo as notas fraudulentas.",
    "clues": [
      "As notas falsas têm a mesma numeração.",
      "Um feirante começou a aceitar apenas PIX recentemente.",
      "Uma nova barraca apareceu sem cadastro oficial."
    ],
    "suspects": [
      {
        "id": "feirante_antigo",
        "name": "Naldo",
        "description": "Feirante antigo, conhecido por ser honesto."
      },
      {
        "id": "barraca_nova",
        "name": "Lívia",
        "description": "Dona da barraca nova, sempre recebe dinheiro vivo."
      },
      {
        "id": "cliente_misterioso",
        "name": "Homem de capuz",
        "description": "Aparece rapidamente e sempre paga com notas altas."
      }
    ],
    "correctSuspectId": "barraca_nova",
    "solutionText": "Lívia distribuía as notas falsas usando o movimento intenso para despistar."
  }
]
